GopalSaraf/Practicals/PSDL/include/proc/pic18f27q43.h
// Register: SPI1INTF
#define SPI1INTF SPI1INTF
extern volatile unsigned char           SPI1INTF            __at(0x08A);
#ifndef _LIB_BUILD
asm("SPI1INTF equ 08Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TXUIF                  :1;
        unsigned RXOIF                  :1;
        unsigned                        :1;
        unsigned EOSIF                  :1;
        unsigned SOSIF                  :1;
        unsigned TCZIF                  :1;
        unsigned SRMTIF                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1TXUIF              :1;
        unsigned SPI1RXOIF              :1;
        unsigned                        :1;
        unsigned SPI1EOSIF              :1;
        unsigned SPI1SOSIF              :1;
        unsigned SPI1TCZIF              :1;
        unsigned SPI1SRMTIF             :1;
    };
} SPI1INTFbits_t;
extern volatile SPI1INTFbits_t SPI1INTFbits __at(0x08A);
// bitfield macros
#define _SPI1INTF_TXUIF_POSN                                0x1
#define _SPI1INTF_TXUIF_POSITION                            0x1
#define _SPI1INTF_TXUIF_SIZE                                0x1
#define _SPI1INTF_TXUIF_LENGTH                              0x1
#define _SPI1INTF_TXUIF_MASK                                0x2
#define _SPI1INTF_RXOIF_POSN                                0x2
#define _SPI1INTF_RXOIF_POSITION                            0x2
#define _SPI1INTF_RXOIF_SIZE                                0x1
#define _SPI1INTF_RXOIF_LENGTH                              0x1
#define _SPI1INTF_RXOIF_MASK                                0x4
#define _SPI1INTF_EOSIF_POSN                                0x4
#define _SPI1INTF_EOSIF_POSITION                            0x4
#define _SPI1INTF_EOSIF_SIZE                                0x1
#define _SPI1INTF_EOSIF_LENGTH                              0x1
#define _SPI1INTF_EOSIF_MASK                                0x10
#define _SPI1INTF_SOSIF_POSN                                0x5
#define _SPI1INTF_SOSIF_POSITION                            0x5
#define _SPI1INTF_SOSIF_SIZE                                0x1
#define _SPI1INTF_SOSIF_LENGTH                              0x1
#define _SPI1INTF_SOSIF_MASK                                0x20
#define _SPI1INTF_TCZIF_POSN                                0x6
#define _SPI1INTF_TCZIF_POSITION                            0x6
#define _SPI1INTF_TCZIF_SIZE                                0x1
#define _SPI1INTF_TCZIF_LENGTH                              0x1
#define _SPI1INTF_TCZIF_MASK                                0x40
#define _SPI1INTF_SRMTIF_POSN                               0x7
#define _SPI1INTF_SRMTIF_POSITION                           0x7
#define _SPI1INTF_SRMTIF_SIZE                               0x1
#define _SPI1INTF_SRMTIF_LENGTH                             0x1
#define _SPI1INTF_SRMTIF_MASK                               0x80
#define _SPI1INTF_SPI1TXUIF_POSN                            0x1
#define _SPI1INTF_SPI1TXUIF_POSITION                        0x1
#define _SPI1INTF_SPI1TXUIF_SIZE                            0x1
#define _SPI1INTF_SPI1TXUIF_LENGTH                          0x1
#define _SPI1INTF_SPI1TXUIF_MASK                            0x2
#define _SPI1INTF_SPI1RXOIF_POSN                            0x2
#define _SPI1INTF_SPI1RXOIF_POSITION                        0x2
#define _SPI1INTF_SPI1RXOIF_SIZE                            0x1
#define _SPI1INTF_SPI1RXOIF_LENGTH                          0x1
#define _SPI1INTF_SPI1RXOIF_MASK                            0x4
#define _SPI1INTF_SPI1EOSIF_POSN                            0x4
#define _SPI1INTF_SPI1EOSIF_POSITION                        0x4
#define _SPI1INTF_SPI1EOSIF_SIZE                            0x1
#define _SPI1INTF_SPI1EOSIF_LENGTH                          0x1
#define _SPI1INTF_SPI1EOSIF_MASK                            0x10
#define _SPI1INTF_SPI1SOSIF_POSN                            0x5
#define _SPI1INTF_SPI1SOSIF_POSITION                        0x5
#define _SPI1INTF_SPI1SOSIF_SIZE                            0x1
#define _SPI1INTF_SPI1SOSIF_LENGTH                          0x1
#define _SPI1INTF_SPI1SOSIF_MASK                            0x20
#define _SPI1INTF_SPI1TCZIF_POSN                            0x6
#define _SPI1INTF_SPI1TCZIF_POSITION                        0x6
#define _SPI1INTF_SPI1TCZIF_SIZE                            0x1
#define _SPI1INTF_SPI1TCZIF_LENGTH                          0x1
#define _SPI1INTF_SPI1TCZIF_MASK                            0x40
#define _SPI1INTF_SPI1SRMTIF_POSN                           0x7
#define _SPI1INTF_SPI1SRMTIF_POSITION                       0x7
#define _SPI1INTF_SPI1SRMTIF_SIZE                           0x1
#define _SPI1INTF_SPI1SRMTIF_LENGTH                         0x1
#define _SPI1INTF_SPI1SRMTIF_MASK                           0x80

// Register: SPI1INTE
#define SPI1INTE SPI1INTE
extern volatile unsigned char           SPI1INTE            __at(0x08B);
#ifndef _LIB_BUILD
asm("SPI1INTE equ 08Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TXUIE                  :1;
        unsigned RXOIE                  :1;
        unsigned                        :1;
        unsigned EOSIE                  :1;
        unsigned SOSIE                  :1;
        unsigned TCZIE                  :1;
        unsigned SRMTIE                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1TXUIE              :1;
        unsigned SPI1RXOIE              :1;
        unsigned                        :1;
        unsigned SPI1EOSIE              :1;
        unsigned SPI1SOSIE              :1;
        unsigned SPI1TCZIE              :1;
        unsigned SPI1SRMTIE             :1;
    };
} SPI1INTEbits_t;
extern volatile SPI1INTEbits_t SPI1INTEbits __at(0x08B);
// bitfield macros
#define _SPI1INTE_TXUIE_POSN                                0x1
#define _SPI1INTE_TXUIE_POSITION                            0x1
#define _SPI1INTE_TXUIE_SIZE                                0x1
#define _SPI1INTE_TXUIE_LENGTH                              0x1
#define _SPI1INTE_TXUIE_MASK                                0x2
#define _SPI1INTE_RXOIE_POSN                                0x2
#define _SPI1INTE_RXOIE_POSITION                            0x2
#define _SPI1INTE_RXOIE_SIZE                                0x1
#define _SPI1INTE_RXOIE_LENGTH                              0x1
#define _SPI1INTE_RXOIE_MASK                                0x4
#define _SPI1INTE_EOSIE_POSN                                0x4
#define _SPI1INTE_EOSIE_POSITION                            0x4
#define _SPI1INTE_EOSIE_SIZE                                0x1
#define _SPI1INTE_EOSIE_LENGTH                              0x1
#define _SPI1INTE_EOSIE_MASK                                0x10
#define _SPI1INTE_SOSIE_POSN                                0x5
#define _SPI1INTE_SOSIE_POSITION                            0x5
#define _SPI1INTE_SOSIE_SIZE                                0x1
#define _SPI1INTE_SOSIE_LENGTH                              0x1
#define _SPI1INTE_SOSIE_MASK                                0x20
#define _SPI1INTE_TCZIE_POSN                                0x6
#define _SPI1INTE_TCZIE_POSITION                            0x6
#define _SPI1INTE_TCZIE_SIZE                                0x1
#define _SPI1INTE_TCZIE_LENGTH                              0x1
#define _SPI1INTE_TCZIE_MASK                                0x40
#define _SPI1INTE_SRMTIE_POSN                               0x7
#define _SPI1INTE_SRMTIE_POSITION                           0x7
#define _SPI1INTE_SRMTIE_SIZE                               0x1
#define _SPI1INTE_SRMTIE_LENGTH                             0x1
#define _SPI1INTE_SRMTIE_MASK                               0x80
#define _SPI1INTE_SPI1TXUIE_POSN                            0x1
#define _SPI1INTE_SPI1TXUIE_POSITION                        0x1
#define _SPI1INTE_SPI1TXUIE_SIZE                            0x1
#define _SPI1INTE_SPI1TXUIE_LENGTH                          0x1
#define _SPI1INTE_SPI1TXUIE_MASK                            0x2
#define _SPI1INTE_SPI1RXOIE_POSN                            0x2
#define _SPI1INTE_SPI1RXOIE_POSITION                        0x2
#define _SPI1INTE_SPI1RXOIE_SIZE                            0x1
#define _SPI1INTE_SPI1RXOIE_LENGTH                          0x1
#define _SPI1INTE_SPI1RXOIE_MASK                            0x4
#define _SPI1INTE_SPI1EOSIE_POSN                            0x4
#define _SPI1INTE_SPI1EOSIE_POSITION                        0x4
#define _SPI1INTE_SPI1EOSIE_SIZE                            0x1
#define _SPI1INTE_SPI1EOSIE_LENGTH                          0x1
#define _SPI1INTE_SPI1EOSIE_MASK                            0x10
#define _SPI1INTE_SPI1SOSIE_POSN                            0x5
#define _SPI1INTE_SPI1SOSIE_POSITION                        0x5
#define _SPI1INTE_SPI1SOSIE_SIZE                            0x1
#define _SPI1INTE_SPI1SOSIE_LENGTH                          0x1
#define _SPI1INTE_SPI1SOSIE_MASK                            0x20
#define _SPI1INTE_SPI1TCZIE_POSN                            0x6
#define _SPI1INTE_SPI1TCZIE_POSITION                        0x6
#define _SPI1INTE_SPI1TCZIE_SIZE                            0x1
#define _SPI1INTE_SPI1TCZIE_LENGTH                          0x1
#define _SPI1INTE_SPI1TCZIE_MASK                            0x40
#define _SPI1INTE_SPI1SRMTIE_POSN                           0x7
#define _SPI1INTE_SPI1SRMTIE_POSITION                       0x7
#define _SPI1INTE_SPI1SRMTIE_SIZE                           0x1
#define _SPI1INTE_SPI1SRMTIE_LENGTH                         0x1
#define _SPI1INTE_SPI1SRMTIE_MASK                           0x80

// Register: SPI1CLK
#define SPI1CLK SPI1CLK
extern volatile unsigned char           SPI1CLK             __at(0x08C);
#ifndef _LIB_BUILD
asm("SPI1CLK equ 08Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLKSEL                 :8;
    };
    struct {
        unsigned CLKSEL0                :1;
        unsigned CLKSEL1                :1;
        unsigned CLKSEL2                :1;
        unsigned CLKSEL3                :1;
        unsigned CLKSEL4                :1;
    };
    struct {
        unsigned SPI1CLKSEL             :8;
    };
    struct {
        unsigned SPI1CLKSEL0            :1;
        unsigned SPI1CLKSEL1            :1;
        unsigned SPI1CLKSEL2            :1;
        unsigned SPI1CLKSEL3            :1;
        unsigned SPI1CLKSEL4            :1;
    };
} SPI1CLKbits_t;
extern volatile SPI1CLKbits_t SPI1CLKbits __at(0x08C);
// bitfield macros
#define _SPI1CLK_CLKSEL_POSN                                0x0
#define _SPI1CLK_CLKSEL_POSITION                            0x0
#define _SPI1CLK_CLKSEL_SIZE                                0x8
#define _SPI1CLK_CLKSEL_LENGTH                              0x8
#define _SPI1CLK_CLKSEL_MASK                                0xFF
#define _SPI1CLK_CLKSEL0_POSN                               0x0
#define _SPI1CLK_CLKSEL0_POSITION                           0x0
#define _SPI1CLK_CLKSEL0_SIZE                               0x1
#define _SPI1CLK_CLKSEL0_LENGTH                             0x1
#define _SPI1CLK_CLKSEL0_MASK                               0x1
#define _SPI1CLK_CLKSEL1_POSN                               0x1
#define _SPI1CLK_CLKSEL1_POSITION                           0x1
#define _SPI1CLK_CLKSEL1_SIZE                               0x1
#define _SPI1CLK_CLKSEL1_LENGTH                             0x1
#define _SPI1CLK_CLKSEL1_MASK                               0x2
#define _SPI1CLK_CLKSEL2_POSN                               0x2
#define _SPI1CLK_CLKSEL2_POSITION                           0x2
#define _SPI1CLK_CLKSEL2_SIZE                               0x1
#define _SPI1CLK_CLKSEL2_LENGTH                             0x1
#define _SPI1CLK_CLKSEL2_MASK                               0x4
#define _SPI1CLK_CLKSEL3_POSN                               0x3
#define _SPI1CLK_CLKSEL3_POSITION                           0x3
#define _SPI1CLK_CLKSEL3_SIZE                               0x1
#define _SPI1CLK_CLKSEL3_LENGTH                             0x1
#define _SPI1CLK_CLKSEL3_MASK                               0x8
#define _SPI1CLK_CLKSEL4_POSN                               0x4
#define _SPI1CLK_CLKSEL4_POSITION                           0x4
#define _SPI1CLK_CLKSEL4_SIZE                               0x1
#define _SPI1CLK_CLKSEL4_LENGTH                             0x1
#define _SPI1CLK_CLKSEL4_MASK                               0x10
#define _SPI1CLK_SPI1CLKSEL_POSN                            0x0
#define _SPI1CLK_SPI1CLKSEL_POSITION                        0x0
#define _SPI1CLK_SPI1CLKSEL_SIZE                            0x8
#define _SPI1CLK_SPI1CLKSEL_LENGTH                          0x8
#define _SPI1CLK_SPI1CLKSEL_MASK                            0xFF
#define _SPI1CLK_SPI1CLKSEL0_POSN                           0x0
#define _SPI1CLK_SPI1CLKSEL0_POSITION                       0x0
#define _SPI1CLK_SPI1CLKSEL0_SIZE                           0x1
#define _SPI1CLK_SPI1CLKSEL0_LENGTH                         0x1
#define _SPI1CLK_SPI1CLKSEL0_MASK                           0x1
#define _SPI1CLK_SPI1CLKSEL1_POSN                           0x1
#define _SPI1CLK_SPI1CLKSEL1_POSITION                       0x1
#define _SPI1CLK_SPI1CLKSEL1_SIZE                           0x1
#define _SPI1CLK_SPI1CLKSEL1_LENGTH                         0x1
#define _SPI1CLK_SPI1CLKSEL1_MASK                           0x2
#define _SPI1CLK_SPI1CLKSEL2_POSN                           0x2
#define _SPI1CLK_SPI1CLKSEL2_POSITION                       0x2
#define _SPI1CLK_SPI1CLKSEL2_SIZE                           0x1
#define _SPI1CLK_SPI1CLKSEL2_LENGTH                         0x1
#define _SPI1CLK_SPI1CLKSEL2_MASK                           0x4
#define _SPI1CLK_SPI1CLKSEL3_POSN                           0x3
#define _SPI1CLK_SPI1CLKSEL3_POSITION                       0x3
#define _SPI1CLK_SPI1CLKSEL3_SIZE                           0x1
#define _SPI1CLK_SPI1CLKSEL3_LENGTH                         0x1
#define _SPI1CLK_SPI1CLKSEL3_MASK                           0x8
#define _SPI1CLK_SPI1CLKSEL4_POSN                           0x4
#define _SPI1CLK_SPI1CLKSEL4_POSITION                       0x4
#define _SPI1CLK_SPI1CLKSEL4_SIZE                           0x1
#define _SPI1CLK_SPI1CLKSEL4_LENGTH                         0x1
#define _SPI1CLK_SPI1CLKSEL4_MASK                           0x10

// Register: SPI2RXB
#define SPI2RXB SPI2RXB
extern volatile unsigned char           SPI2RXB             __at(0x08D);
#ifndef _LIB_BUILD
asm("SPI2RXB equ 08Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
    struct {
        unsigned RXB0                   :1;
        unsigned RXB1                   :1;
        unsigned RXB2                   :1;
        unsigned RXB3                   :1;
        unsigned RXB4                   :1;
        unsigned RXB5                   :1;
        unsigned RXB6                   :1;
        unsigned RXB7                   :1;
    };
} SPI2RXBbits_t;
extern volatile SPI2RXBbits_t SPI2RXBbits __at(0x08D);
// bitfield macros
#define _SPI2RXB_RXB_POSN                                   0x0
#define _SPI2RXB_RXB_POSITION                               0x0
#define _SPI2RXB_RXB_SIZE                                   0x8
#define _SPI2RXB_RXB_LENGTH                                 0x8
#define _SPI2RXB_RXB_MASK                                   0xFF
#define _SPI2RXB_RXB0_POSN                                  0x0
#define _SPI2RXB_RXB0_POSITION                              0x0
#define _SPI2RXB_RXB0_SIZE                                  0x1
#define _SPI2RXB_RXB0_LENGTH                                0x1
#define _SPI2RXB_RXB0_MASK                                  0x1
#define _SPI2RXB_RXB1_POSN                                  0x1
#define _SPI2RXB_RXB1_POSITION                              0x1
#define _SPI2RXB_RXB1_SIZE                                  0x1
#define _SPI2RXB_RXB1_LENGTH                                0x1
#define _SPI2RXB_RXB1_MASK                                  0x2
#define _SPI2RXB_RXB2_POSN                                  0x2
#define _SPI2RXB_RXB2_POSITION                              0x2
#define _SPI2RXB_RXB2_SIZE                                  0x1
#define _SPI2RXB_RXB2_LENGTH                                0x1
#define _SPI2RXB_RXB2_MASK                                  0x4
#define _SPI2RXB_RXB3_POSN                                  0x3
#define _SPI2RXB_RXB3_POSITION                              0x3
#define _SPI2RXB_RXB3_SIZE                                  0x1
#define _SPI2RXB_RXB3_LENGTH                                0x1
#define _SPI2RXB_RXB3_MASK                                  0x8
#define _SPI2RXB_RXB4_POSN                                  0x4
#define _SPI2RXB_RXB4_POSITION                              0x4
#define _SPI2RXB_RXB4_SIZE                                  0x1
#define _SPI2RXB_RXB4_LENGTH                                0x1
#define _SPI2RXB_RXB4_MASK                                  0x10
#define _SPI2RXB_RXB5_POSN                                  0x5
#define _SPI2RXB_RXB5_POSITION                              0x5
#define _SPI2RXB_RXB5_SIZE                                  0x1
#define _SPI2RXB_RXB5_LENGTH                                0x1
#define _SPI2RXB_RXB5_MASK                                  0x20
#define _SPI2RXB_RXB6_POSN                                  0x6
#define _SPI2RXB_RXB6_POSITION                              0x6
#define _SPI2RXB_RXB6_SIZE                                  0x1
#define _SPI2RXB_RXB6_LENGTH                                0x1
#define _SPI2RXB_RXB6_MASK                                  0x40
#define _SPI2RXB_RXB7_POSN                                  0x7
#define _SPI2RXB_RXB7_POSITION                              0x7
#define _SPI2RXB_RXB7_SIZE                                  0x1
#define _SPI2RXB_RXB7_LENGTH                                0x1
#define _SPI2RXB_RXB7_MASK                                  0x80

// Register: SPI2TXB
#define SPI2TXB SPI2TXB
extern volatile unsigned char           SPI2TXB             __at(0x08E);
#ifndef _LIB_BUILD
asm("SPI2TXB equ 08Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
    struct {
        unsigned TXB0                   :1;
        unsigned TXB1                   :1;
        unsigned TXB2                   :1;
        unsigned TXB3                   :1;
        unsigned TXB4                   :1;
        unsigned TXB5                   :1;
        unsigned TXB6                   :1;
        unsigned TXB7                   :1;
    };
} SPI2TXBbits_t;
extern volatile SPI2TXBbits_t SPI2TXBbits __at(0x08E);
// bitfield macros
#define _SPI2TXB_TXB_POSN                                   0x0
#define _SPI2TXB_TXB_POSITION                               0x0
#define _SPI2TXB_TXB_SIZE                                   0x8
#define _SPI2TXB_TXB_LENGTH                                 0x8
#define _SPI2TXB_TXB_MASK                                   0xFF
#define _SPI2TXB_TXB0_POSN                                  0x0
#define _SPI2TXB_TXB0_POSITION                              0x0
#define _SPI2TXB_TXB0_SIZE                                  0x1
#define _SPI2TXB_TXB0_LENGTH                                0x1
#define _SPI2TXB_TXB0_MASK                                  0x1
#define _SPI2TXB_TXB1_POSN                                  0x1
#define _SPI2TXB_TXB1_POSITION                              0x1
#define _SPI2TXB_TXB1_SIZE                                  0x1
#define _SPI2TXB_TXB1_LENGTH                                0x1
#define _SPI2TXB_TXB1_MASK                                  0x2
#define _SPI2TXB_TXB2_POSN                                  0x2
#define _SPI2TXB_TXB2_POSITION                              0x2
#define _SPI2TXB_TXB2_SIZE                                  0x1
#define _SPI2TXB_TXB2_LENGTH                                0x1
#define _SPI2TXB_TXB2_MASK                                  0x4
#define _SPI2TXB_TXB3_POSN                                  0x3
#define _SPI2TXB_TXB3_POSITION                              0x3
#define _SPI2TXB_TXB3_SIZE                                  0x1
#define _SPI2TXB_TXB3_LENGTH                                0x1
#define _SPI2TXB_TXB3_MASK                                  0x8
#define _SPI2TXB_TXB4_POSN                                  0x4
#define _SPI2TXB_TXB4_POSITION                              0x4
#define _SPI2TXB_TXB4_SIZE                                  0x1
#define _SPI2TXB_TXB4_LENGTH                                0x1
#define _SPI2TXB_TXB4_MASK                                  0x10
#define _SPI2TXB_TXB5_POSN                                  0x5
#define _SPI2TXB_TXB5_POSITION                              0x5
#define _SPI2TXB_TXB5_SIZE                                  0x1
#define _SPI2TXB_TXB5_LENGTH                                0x1
#define _SPI2TXB_TXB5_MASK                                  0x20
#define _SPI2TXB_TXB6_POSN                                  0x6
#define _SPI2TXB_TXB6_POSITION                              0x6
#define _SPI2TXB_TXB6_SIZE                                  0x1
#define _SPI2TXB_TXB6_LENGTH                                0x1
#define _SPI2TXB_TXB6_MASK                                  0x40
#define _SPI2TXB_TXB7_POSN                                  0x7
#define _SPI2TXB_TXB7_POSITION                              0x7
#define _SPI2TXB_TXB7_SIZE                                  0x1
#define _SPI2TXB_TXB7_LENGTH                                0x1
#define _SPI2TXB_TXB7_MASK                                  0x80

// Register: SPI2TCNT
#define SPI2TCNT SPI2TCNT
extern volatile unsigned short          SPI2TCNT            __at(0x08F);
#ifndef _LIB_BUILD
asm("SPI2TCNT equ 08Fh");
#endif

// Register: SPI2TCNTL
#define SPI2TCNTL SPI2TCNTL
extern volatile unsigned char           SPI2TCNTL           __at(0x08F);
#ifndef _LIB_BUILD
asm("SPI2TCNTL equ 08Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TCNTL                  :8;
    };
} SPI2TCNTLbits_t;
extern volatile SPI2TCNTLbits_t SPI2TCNTLbits __at(0x08F);
// bitfield macros
#define _SPI2TCNTL_TCNTL_POSN                               0x0
#define _SPI2TCNTL_TCNTL_POSITION                           0x0
#define _SPI2TCNTL_TCNTL_SIZE                               0x8
#define _SPI2TCNTL_TCNTL_LENGTH                             0x8
#define _SPI2TCNTL_TCNTL_MASK                               0xFF

// Register: SPI2TCNTH
#define SPI2TCNTH SPI2TCNTH
extern volatile unsigned char           SPI2TCNTH           __at(0x090);
#ifndef _LIB_BUILD
asm("SPI2TCNTH equ 090h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TCNTH                  :3;
    };
} SPI2TCNTHbits_t;
