GopalSaraf/Practicals/PSDL/include/proc/pic18f27q43.h
// Register: DMAnCON1
#define DMAnCON1 DMAnCON1
extern volatile unsigned char           DMAnCON1            __at(0x0FD);
#ifndef _LIB_BUILD
asm("DMAnCON1 equ 0FDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSTP                   :1;
        unsigned SMODE                  :2;
        unsigned SMR                    :2;
        unsigned DSTP                   :1;
        unsigned DMODE                  :2;
    };
} DMAnCON1bits_t;
extern volatile DMAnCON1bits_t DMAnCON1bits __at(0x0FD);
// bitfield macros
#define _DMAnCON1_SSTP_POSN                                 0x0
#define _DMAnCON1_SSTP_POSITION                             0x0
#define _DMAnCON1_SSTP_SIZE                                 0x1
#define _DMAnCON1_SSTP_LENGTH                               0x1
#define _DMAnCON1_SSTP_MASK                                 0x1
#define _DMAnCON1_SMODE_POSN                                0x1
#define _DMAnCON1_SMODE_POSITION                            0x1
#define _DMAnCON1_SMODE_SIZE                                0x2
#define _DMAnCON1_SMODE_LENGTH                              0x2
#define _DMAnCON1_SMODE_MASK                                0x6
#define _DMAnCON1_SMR_POSN                                  0x3
#define _DMAnCON1_SMR_POSITION                              0x3
#define _DMAnCON1_SMR_SIZE                                  0x2
#define _DMAnCON1_SMR_LENGTH                                0x2
#define _DMAnCON1_SMR_MASK                                  0x18
#define _DMAnCON1_DSTP_POSN                                 0x5
#define _DMAnCON1_DSTP_POSITION                             0x5
#define _DMAnCON1_DSTP_SIZE                                 0x1
#define _DMAnCON1_DSTP_LENGTH                               0x1
#define _DMAnCON1_DSTP_MASK                                 0x20
#define _DMAnCON1_DMODE_POSN                                0x6
#define _DMAnCON1_DMODE_POSITION                            0x6
#define _DMAnCON1_DMODE_SIZE                                0x2
#define _DMAnCON1_DMODE_LENGTH                              0x2
#define _DMAnCON1_DMODE_MASK                                0xC0

// Register: DMAnAIRQ
#define DMAnAIRQ DMAnAIRQ
extern volatile unsigned char           DMAnAIRQ            __at(0x0FE);
#ifndef _LIB_BUILD
asm("DMAnAIRQ equ 0FEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AIRQ                   :8;
    };
    struct {
        unsigned AIRQ0                  :1;
        unsigned AIRQ1                  :1;
        unsigned AIRQ2                  :1;
        unsigned AIRQ3                  :1;
        unsigned AIRQ4                  :1;
        unsigned AIRQ5                  :1;
        unsigned AIRQ6                  :1;
        unsigned AIRQ7                  :1;
    };
} DMAnAIRQbits_t;
extern volatile DMAnAIRQbits_t DMAnAIRQbits __at(0x0FE);
// bitfield macros
#define _DMAnAIRQ_AIRQ_POSN                                 0x0
#define _DMAnAIRQ_AIRQ_POSITION                             0x0
#define _DMAnAIRQ_AIRQ_SIZE                                 0x8
#define _DMAnAIRQ_AIRQ_LENGTH                               0x8
#define _DMAnAIRQ_AIRQ_MASK                                 0xFF
#define _DMAnAIRQ_AIRQ0_POSN                                0x0
#define _DMAnAIRQ_AIRQ0_POSITION                            0x0
#define _DMAnAIRQ_AIRQ0_SIZE                                0x1
#define _DMAnAIRQ_AIRQ0_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ0_MASK                                0x1
#define _DMAnAIRQ_AIRQ1_POSN                                0x1
#define _DMAnAIRQ_AIRQ1_POSITION                            0x1
#define _DMAnAIRQ_AIRQ1_SIZE                                0x1
#define _DMAnAIRQ_AIRQ1_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ1_MASK                                0x2
#define _DMAnAIRQ_AIRQ2_POSN                                0x2
#define _DMAnAIRQ_AIRQ2_POSITION                            0x2
#define _DMAnAIRQ_AIRQ2_SIZE                                0x1
#define _DMAnAIRQ_AIRQ2_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ2_MASK                                0x4
#define _DMAnAIRQ_AIRQ3_POSN                                0x3
#define _DMAnAIRQ_AIRQ3_POSITION                            0x3
#define _DMAnAIRQ_AIRQ3_SIZE                                0x1
#define _DMAnAIRQ_AIRQ3_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ3_MASK                                0x8
#define _DMAnAIRQ_AIRQ4_POSN                                0x4
#define _DMAnAIRQ_AIRQ4_POSITION                            0x4
#define _DMAnAIRQ_AIRQ4_SIZE                                0x1
#define _DMAnAIRQ_AIRQ4_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ4_MASK                                0x10
#define _DMAnAIRQ_AIRQ5_POSN                                0x5
#define _DMAnAIRQ_AIRQ5_POSITION                            0x5
#define _DMAnAIRQ_AIRQ5_SIZE                                0x1
#define _DMAnAIRQ_AIRQ5_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ5_MASK                                0x20
#define _DMAnAIRQ_AIRQ6_POSN                                0x6
#define _DMAnAIRQ_AIRQ6_POSITION                            0x6
#define _DMAnAIRQ_AIRQ6_SIZE                                0x1
#define _DMAnAIRQ_AIRQ6_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ6_MASK                                0x40
#define _DMAnAIRQ_AIRQ7_POSN                                0x7
#define _DMAnAIRQ_AIRQ7_POSITION                            0x7
#define _DMAnAIRQ_AIRQ7_SIZE                                0x1
#define _DMAnAIRQ_AIRQ7_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ7_MASK                                0x80

// Register: DMAnSIRQ
#define DMAnSIRQ DMAnSIRQ
extern volatile unsigned char           DMAnSIRQ            __at(0x0FF);
#ifndef _LIB_BUILD
asm("DMAnSIRQ equ 0FFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SIRQ                   :8;
    };
    struct {
        unsigned SIRQ0                  :1;
        unsigned SIRQ1                  :1;
        unsigned SIRQ2                  :1;
        unsigned SIRQ3                  :1;
        unsigned SIRQ4                  :1;
        unsigned SIRQ5                  :1;
        unsigned SIRQ6                  :1;
        unsigned SIRQ7                  :1;
    };
} DMAnSIRQbits_t;
extern volatile DMAnSIRQbits_t DMAnSIRQbits __at(0x0FF);
// bitfield macros
#define _DMAnSIRQ_SIRQ_POSN                                 0x0
#define _DMAnSIRQ_SIRQ_POSITION                             0x0
#define _DMAnSIRQ_SIRQ_SIZE                                 0x8
#define _DMAnSIRQ_SIRQ_LENGTH                               0x8
#define _DMAnSIRQ_SIRQ_MASK                                 0xFF
#define _DMAnSIRQ_SIRQ0_POSN                                0x0
#define _DMAnSIRQ_SIRQ0_POSITION                            0x0
#define _DMAnSIRQ_SIRQ0_SIZE                                0x1
#define _DMAnSIRQ_SIRQ0_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ0_MASK                                0x1
#define _DMAnSIRQ_SIRQ1_POSN                                0x1
#define _DMAnSIRQ_SIRQ1_POSITION                            0x1
#define _DMAnSIRQ_SIRQ1_SIZE                                0x1
#define _DMAnSIRQ_SIRQ1_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ1_MASK                                0x2
#define _DMAnSIRQ_SIRQ2_POSN                                0x2
#define _DMAnSIRQ_SIRQ2_POSITION                            0x2
#define _DMAnSIRQ_SIRQ2_SIZE                                0x1
#define _DMAnSIRQ_SIRQ2_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ2_MASK                                0x4
#define _DMAnSIRQ_SIRQ3_POSN                                0x3
#define _DMAnSIRQ_SIRQ3_POSITION                            0x3
#define _DMAnSIRQ_SIRQ3_SIZE                                0x1
#define _DMAnSIRQ_SIRQ3_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ3_MASK                                0x8
#define _DMAnSIRQ_SIRQ4_POSN                                0x4
#define _DMAnSIRQ_SIRQ4_POSITION                            0x4
#define _DMAnSIRQ_SIRQ4_SIZE                                0x1
#define _DMAnSIRQ_SIRQ4_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ4_MASK                                0x10
#define _DMAnSIRQ_SIRQ5_POSN                                0x5
#define _DMAnSIRQ_SIRQ5_POSITION                            0x5
#define _DMAnSIRQ_SIRQ5_SIZE                                0x1
#define _DMAnSIRQ_SIRQ5_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ5_MASK                                0x20
#define _DMAnSIRQ_SIRQ6_POSN                                0x6
#define _DMAnSIRQ_SIRQ6_POSITION                            0x6
#define _DMAnSIRQ_SIRQ6_SIZE                                0x1
#define _DMAnSIRQ_SIRQ6_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ6_MASK                                0x40
#define _DMAnSIRQ_SIRQ7_POSN                                0x7
#define _DMAnSIRQ_SIRQ7_POSITION                            0x7
#define _DMAnSIRQ_SIRQ7_SIZE                                0x1
#define _DMAnSIRQ_SIRQ7_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ7_MASK                                0x80

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0x200);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 0200h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0x200);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0x201);
#ifndef _LIB_BUILD
asm("RA0PPS equ 0201h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS0                :1;
        unsigned RA0PPS1                :1;
        unsigned RA0PPS2                :1;
        unsigned RA0PPS3                :1;
        unsigned RA0PPS4                :1;
        unsigned RA0PPS5                :1;
        unsigned RA0PPS6                :1;
    };
} RA0PPSbits_t;
extern volatile RA0PPSbits_t RA0PPSbits __at(0x201);
// bitfield macros
#define _RA0PPS_RA0PPS0_POSN                                0x0
#define _RA0PPS_RA0PPS0_POSITION                            0x0
#define _RA0PPS_RA0PPS0_SIZE                                0x1
#define _RA0PPS_RA0PPS0_LENGTH                              0x1
#define _RA0PPS_RA0PPS0_MASK                                0x1
#define _RA0PPS_RA0PPS1_POSN                                0x1
#define _RA0PPS_RA0PPS1_POSITION                            0x1
#define _RA0PPS_RA0PPS1_SIZE                                0x1
#define _RA0PPS_RA0PPS1_LENGTH                              0x1
#define _RA0PPS_RA0PPS1_MASK                                0x2
#define _RA0PPS_RA0PPS2_POSN                                0x2
#define _RA0PPS_RA0PPS2_POSITION                            0x2
#define _RA0PPS_RA0PPS2_SIZE                                0x1
#define _RA0PPS_RA0PPS2_LENGTH                              0x1
#define _RA0PPS_RA0PPS2_MASK                                0x4
#define _RA0PPS_RA0PPS3_POSN                                0x3
#define _RA0PPS_RA0PPS3_POSITION                            0x3
#define _RA0PPS_RA0PPS3_SIZE                                0x1
#define _RA0PPS_RA0PPS3_LENGTH                              0x1
#define _RA0PPS_RA0PPS3_MASK                                0x8
#define _RA0PPS_RA0PPS4_POSN                                0x4
#define _RA0PPS_RA0PPS4_POSITION                            0x4
#define _RA0PPS_RA0PPS4_SIZE                                0x1
#define _RA0PPS_RA0PPS4_LENGTH                              0x1
#define _RA0PPS_RA0PPS4_MASK                                0x10
#define _RA0PPS_RA0PPS5_POSN                                0x5
#define _RA0PPS_RA0PPS5_POSITION                            0x5
#define _RA0PPS_RA0PPS5_SIZE                                0x1
#define _RA0PPS_RA0PPS5_LENGTH                              0x1
#define _RA0PPS_RA0PPS5_MASK                                0x20
#define _RA0PPS_RA0PPS6_POSN                                0x6
#define _RA0PPS_RA0PPS6_POSITION                            0x6
#define _RA0PPS_RA0PPS6_SIZE                                0x1
#define _RA0PPS_RA0PPS6_LENGTH                              0x1
#define _RA0PPS_RA0PPS6_MASK                                0x40

// Register: RA1PPS
#define RA1PPS RA1PPS
extern volatile unsigned char           RA1PPS              __at(0x202);
#ifndef _LIB_BUILD
asm("RA1PPS equ 0202h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA1PPS0                :1;
        unsigned RA1PPS1                :1;
        unsigned RA1PPS2                :1;
        unsigned RA1PPS3                :1;
        unsigned RA1PPS4                :1;
        unsigned RA1PPS5                :1;
        unsigned RA1PPS6                :1;
    };
} RA1PPSbits_t;
