GopalSaraf/Practicals/PSDL/include/proc/pic18f27q43.h
extern volatile MDCARLPPSbits_t MDCARLPPSbits __at(0x25E);
// bitfield macros
#define _MDCARLPPS_PIN_POSN                                 0x0
#define _MDCARLPPS_PIN_POSITION                             0x0
#define _MDCARLPPS_PIN_SIZE                                 0x3
#define _MDCARLPPS_PIN_LENGTH                               0x3
#define _MDCARLPPS_PIN_MASK                                 0x7
#define _MDCARLPPS_PORT_POSN                                0x3
#define _MDCARLPPS_PORT_POSITION                            0x3
#define _MDCARLPPS_PORT_SIZE                                0x2
#define _MDCARLPPS_PORT_LENGTH                              0x2
#define _MDCARLPPS_PORT_MASK                                0x18
#define _MDCARLPPS_MDCARLPPS0_POSN                          0x0
#define _MDCARLPPS_MDCARLPPS0_POSITION                      0x0
#define _MDCARLPPS_MDCARLPPS0_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS0_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS0_MASK                          0x1
#define _MDCARLPPS_MDCARLPPS1_POSN                          0x1
#define _MDCARLPPS_MDCARLPPS1_POSITION                      0x1
#define _MDCARLPPS_MDCARLPPS1_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS1_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS1_MASK                          0x2
#define _MDCARLPPS_MDCARLPPS2_POSN                          0x2
#define _MDCARLPPS_MDCARLPPS2_POSITION                      0x2
#define _MDCARLPPS_MDCARLPPS2_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS2_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS2_MASK                          0x4
#define _MDCARLPPS_MDCARLPPS3_POSN                          0x3
#define _MDCARLPPS_MDCARLPPS3_POSITION                      0x3
#define _MDCARLPPS_MDCARLPPS3_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS3_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS3_MASK                          0x8
#define _MDCARLPPS_MDCARLPPS4_POSN                          0x4
#define _MDCARLPPS_MDCARLPPS4_POSITION                      0x4
#define _MDCARLPPS_MDCARLPPS4_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS4_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS4_MASK                          0x10
#define _MDCARLPPS_MDCARLPPS_POSN                           0x0
#define _MDCARLPPS_MDCARLPPS_POSITION                       0x0
#define _MDCARLPPS_MDCARLPPS_SIZE                           0x5
#define _MDCARLPPS_MDCARLPPS_LENGTH                         0x5
#define _MDCARLPPS_MDCARLPPS_MASK                           0x1F

// Register: MD1CARHPPS
#define MD1CARHPPS MD1CARHPPS
extern volatile unsigned char           MD1CARHPPS          __at(0x25F);
#ifndef _LIB_BUILD
asm("MD1CARHPPS equ 025Fh");
#endif
// aliases
extern volatile unsigned char           MDCARHPPS           __at(0x25F);
#ifndef _LIB_BUILD
asm("MDCARHPPS equ 025Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned MDCARHPPS0             :1;
        unsigned MDCARHPPS1             :1;
        unsigned MDCARHPPS2             :1;
        unsigned MDCARHPPS3             :1;
        unsigned MDCARHPPS4             :1;
    };
    struct {
        unsigned MDCARHPPS              :5;
    };
} MD1CARHPPSbits_t;
extern volatile MD1CARHPPSbits_t MD1CARHPPSbits __at(0x25F);
// bitfield macros
#define _MD1CARHPPS_PIN_POSN                                0x0
#define _MD1CARHPPS_PIN_POSITION                            0x0
#define _MD1CARHPPS_PIN_SIZE                                0x3
#define _MD1CARHPPS_PIN_LENGTH                              0x3
#define _MD1CARHPPS_PIN_MASK                                0x7
#define _MD1CARHPPS_PORT_POSN                               0x3
#define _MD1CARHPPS_PORT_POSITION                           0x3
#define _MD1CARHPPS_PORT_SIZE                               0x2
#define _MD1CARHPPS_PORT_LENGTH                             0x2
#define _MD1CARHPPS_PORT_MASK                               0x18
#define _MD1CARHPPS_MDCARHPPS0_POSN                         0x0
#define _MD1CARHPPS_MDCARHPPS0_POSITION                     0x0
#define _MD1CARHPPS_MDCARHPPS0_SIZE                         0x1
#define _MD1CARHPPS_MDCARHPPS0_LENGTH                       0x1
#define _MD1CARHPPS_MDCARHPPS0_MASK                         0x1
#define _MD1CARHPPS_MDCARHPPS1_POSN                         0x1
#define _MD1CARHPPS_MDCARHPPS1_POSITION                     0x1
#define _MD1CARHPPS_MDCARHPPS1_SIZE                         0x1
#define _MD1CARHPPS_MDCARHPPS1_LENGTH                       0x1
#define _MD1CARHPPS_MDCARHPPS1_MASK                         0x2
#define _MD1CARHPPS_MDCARHPPS2_POSN                         0x2
#define _MD1CARHPPS_MDCARHPPS2_POSITION                     0x2
#define _MD1CARHPPS_MDCARHPPS2_SIZE                         0x1
#define _MD1CARHPPS_MDCARHPPS2_LENGTH                       0x1
#define _MD1CARHPPS_MDCARHPPS2_MASK                         0x4
#define _MD1CARHPPS_MDCARHPPS3_POSN                         0x3
#define _MD1CARHPPS_MDCARHPPS3_POSITION                     0x3
#define _MD1CARHPPS_MDCARHPPS3_SIZE                         0x1
#define _MD1CARHPPS_MDCARHPPS3_LENGTH                       0x1
#define _MD1CARHPPS_MDCARHPPS3_MASK                         0x8
#define _MD1CARHPPS_MDCARHPPS4_POSN                         0x4
#define _MD1CARHPPS_MDCARHPPS4_POSITION                     0x4
#define _MD1CARHPPS_MDCARHPPS4_SIZE                         0x1
#define _MD1CARHPPS_MDCARHPPS4_LENGTH                       0x1
#define _MD1CARHPPS_MDCARHPPS4_MASK                         0x10
#define _MD1CARHPPS_MDCARHPPS_POSN                          0x0
#define _MD1CARHPPS_MDCARHPPS_POSITION                      0x0
#define _MD1CARHPPS_MDCARHPPS_SIZE                          0x5
#define _MD1CARHPPS_MDCARHPPS_LENGTH                        0x5
#define _MD1CARHPPS_MDCARHPPS_MASK                          0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned MDCARHPPS0             :1;
        unsigned MDCARHPPS1             :1;
        unsigned MDCARHPPS2             :1;
        unsigned MDCARHPPS3             :1;
        unsigned MDCARHPPS4             :1;
    };
    struct {
        unsigned MDCARHPPS              :5;
    };
} MDCARHPPSbits_t;
extern volatile MDCARHPPSbits_t MDCARHPPSbits __at(0x25F);
// bitfield macros
#define _MDCARHPPS_PIN_POSN                                 0x0
#define _MDCARHPPS_PIN_POSITION                             0x0
#define _MDCARHPPS_PIN_SIZE                                 0x3
#define _MDCARHPPS_PIN_LENGTH                               0x3
#define _MDCARHPPS_PIN_MASK                                 0x7
#define _MDCARHPPS_PORT_POSN                                0x3
#define _MDCARHPPS_PORT_POSITION                            0x3
#define _MDCARHPPS_PORT_SIZE                                0x2
#define _MDCARHPPS_PORT_LENGTH                              0x2
#define _MDCARHPPS_PORT_MASK                                0x18
#define _MDCARHPPS_MDCARHPPS0_POSN                          0x0
#define _MDCARHPPS_MDCARHPPS0_POSITION                      0x0
#define _MDCARHPPS_MDCARHPPS0_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS0_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS0_MASK                          0x1
#define _MDCARHPPS_MDCARHPPS1_POSN                          0x1
#define _MDCARHPPS_MDCARHPPS1_POSITION                      0x1
#define _MDCARHPPS_MDCARHPPS1_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS1_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS1_MASK                          0x2
#define _MDCARHPPS_MDCARHPPS2_POSN                          0x2
#define _MDCARHPPS_MDCARHPPS2_POSITION                      0x2
#define _MDCARHPPS_MDCARHPPS2_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS2_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS2_MASK                          0x4
#define _MDCARHPPS_MDCARHPPS3_POSN                          0x3
#define _MDCARHPPS_MDCARHPPS3_POSITION                      0x3
#define _MDCARHPPS_MDCARHPPS3_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS3_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS3_MASK                          0x8
#define _MDCARHPPS_MDCARHPPS4_POSN                          0x4
#define _MDCARHPPS_MDCARHPPS4_POSITION                      0x4
#define _MDCARHPPS_MDCARHPPS4_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS4_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS4_MASK                          0x10
#define _MDCARHPPS_MDCARHPPS_POSN                           0x0
#define _MDCARHPPS_MDCARHPPS_POSITION                       0x0
#define _MDCARHPPS_MDCARHPPS_SIZE                           0x5
#define _MDCARHPPS_MDCARHPPS_LENGTH                         0x5
#define _MDCARHPPS_MDCARHPPS_MASK                           0x1F

// Register: MD1SRCPPS
#define MD1SRCPPS MD1SRCPPS
extern volatile unsigned char           MD1SRCPPS           __at(0x260);
#ifndef _LIB_BUILD
asm("MD1SRCPPS equ 0260h");
#endif
// aliases
extern volatile unsigned char           MDSRCPPS            __at(0x260);
#ifndef _LIB_BUILD
asm("MDSRCPPS equ 0260h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned MDSRCPPS0              :1;
        unsigned MDSRCPPS1              :1;
        unsigned MDSRCPPS2              :1;
        unsigned MDSRCPPS3              :1;
        unsigned MDSRCPPS4              :1;
    };
    struct {
        unsigned MDSRCPPS               :5;
    };
} MD1SRCPPSbits_t;
