GopalSaraf/Practicals/PSDL/include/proc/pic18f27q43.h
extern volatile __bit                   SMT1PR23            __at(0x185F);	// @ (0x30B * 8 + 7)
#define                                 SMT1PR23_bit        _BIT_ACCESS(SMT1PRU,7)
// SMT1PRL<SMT1PR3>
extern volatile __bit                   SMT1PR3             __at(0x184B);	// @ (0x309 * 8 + 3)
#define                                 SMT1PR3_bit         _BIT_ACCESS(SMT1PRL,3)
// SMT1PRL<SMT1PR4>
extern volatile __bit                   SMT1PR4             __at(0x184C);	// @ (0x309 * 8 + 4)
#define                                 SMT1PR4_bit         _BIT_ACCESS(SMT1PRL,4)
// SMT1PRL<SMT1PR5>
extern volatile __bit                   SMT1PR5             __at(0x184D);	// @ (0x309 * 8 + 5)
#define                                 SMT1PR5_bit         _BIT_ACCESS(SMT1PRL,5)
// SMT1PRL<SMT1PR6>
extern volatile __bit                   SMT1PR6             __at(0x184E);	// @ (0x309 * 8 + 6)
#define                                 SMT1PR6_bit         _BIT_ACCESS(SMT1PRL,6)
// SMT1PRL<SMT1PR7>
extern volatile __bit                   SMT1PR7             __at(0x184F);	// @ (0x309 * 8 + 7)
#define                                 SMT1PR7_bit         _BIT_ACCESS(SMT1PRL,7)
// SMT1PRH<SMT1PR8>
extern volatile __bit                   SMT1PR8             __at(0x1850);	// @ (0x30A * 8 + 0)
#define                                 SMT1PR8_bit         _BIT_ACCESS(SMT1PRH,0)
// SMT1PRH<SMT1PR9>
extern volatile __bit                   SMT1PR9             __at(0x1851);	// @ (0x30A * 8 + 1)
#define                                 SMT1PR9_bit         _BIT_ACCESS(SMT1PRH,1)
// PIE1<SMT1PRAIE>
extern volatile __bit                   SMT1PRAIE           __at(0x24FE);	// @ (0x49F * 8 + 6)
#define                                 SMT1PRAIE_bit       _BIT_ACCESS(PIE1,6)
// PIR1<SMT1PRAIF>
extern volatile __bit                   SMT1PRAIF           __at(0x257E);	// @ (0x4AF * 8 + 6)
#define                                 SMT1PRAIF_bit       _BIT_ACCESS(PIR1,6)
// IPR1<SMT1PRAIP>
extern volatile __bit                   SMT1PRAIP           __at(0x1B1E);	// @ (0x363 * 8 + 6)
#define                                 SMT1PRAIP_bit       _BIT_ACCESS(IPR1,6)
// SMT1CON0<SMT1PS0>
extern volatile __bit                   SMT1PS0             __at(0x1860);	// @ (0x30C * 8 + 0)
#define                                 SMT1PS0_bit         _BIT_ACCESS(SMT1CON0,0)
// SMT1CON0<SMT1PS1>
extern volatile __bit                   SMT1PS1             __at(0x1861);	// @ (0x30C * 8 + 1)
#define                                 SMT1PS1_bit         _BIT_ACCESS(SMT1CON0,1)
// PIE1<SMT1PWAIE>
extern volatile __bit                   SMT1PWAIE           __at(0x24FF);	// @ (0x49F * 8 + 7)
#define                                 SMT1PWAIE_bit       _BIT_ACCESS(PIE1,7)
// PIR1<SMT1PWAIF>
extern volatile __bit                   SMT1PWAIF           __at(0x257F);	// @ (0x4AF * 8 + 7)
#define                                 SMT1PWAIF_bit       _BIT_ACCESS(PIR1,7)
// IPR1<SMT1PWAIP>
extern volatile __bit                   SMT1PWAIP           __at(0x1B1F);	// @ (0x363 * 8 + 7)
#define                                 SMT1PWAIP_bit       _BIT_ACCESS(IPR1,7)
// SMT1CON1<SMT1REPEAT>
extern volatile __bit                   SMT1REPEAT          __at(0x186E);	// @ (0x30D * 8 + 6)
#define                                 SMT1REPEAT_bit      _BIT_ACCESS(SMT1CON1,6)
// SMT1STAT<SMT1RESET>
extern volatile __bit                   SMT1RESET           __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 SMT1RESET_bit       _BIT_ACCESS(SMT1STAT,5)
// SMT1SIGPPS<SMT1SIGPPS0>
extern volatile __bit                   SMT1SIGPPS0         __at(0x12D0);	// @ (0x25A * 8 + 0)
#define                                 SMT1SIGPPS0_bit     _BIT_ACCESS(SMT1SIGPPS,0)
// SMT1SIGPPS<SMT1SIGPPS1>
extern volatile __bit                   SMT1SIGPPS1         __at(0x12D1);	// @ (0x25A * 8 + 1)
#define                                 SMT1SIGPPS1_bit     _BIT_ACCESS(SMT1SIGPPS,1)
// SMT1SIGPPS<SMT1SIGPPS2>
extern volatile __bit                   SMT1SIGPPS2         __at(0x12D2);	// @ (0x25A * 8 + 2)
#define                                 SMT1SIGPPS2_bit     _BIT_ACCESS(SMT1SIGPPS,2)
// SMT1SIGPPS<SMT1SIGPPS3>
extern volatile __bit                   SMT1SIGPPS3         __at(0x12D3);	// @ (0x25A * 8 + 3)
#define                                 SMT1SIGPPS3_bit     _BIT_ACCESS(SMT1SIGPPS,3)
// SMT1SIGPPS<SMT1SIGPPS4>
extern volatile __bit                   SMT1SIGPPS4         __at(0x12D4);	// @ (0x25A * 8 + 4)
#define                                 SMT1SIGPPS4_bit     _BIT_ACCESS(SMT1SIGPPS,4)
// SMT1SIGPPS<SMT1SIGPPS5>
extern volatile __bit                   SMT1SIGPPS5         __at(0x12D5);	// @ (0x25A * 8 + 5)
#define                                 SMT1SIGPPS5_bit     _BIT_ACCESS(SMT1SIGPPS,5)
// SMT1SIG<SMT1SSEL0>
extern volatile __bit                   SMT1SSEL0           __at(0x1880);	// @ (0x310 * 8 + 0)
#define                                 SMT1SSEL0_bit       _BIT_ACCESS(SMT1SIG,0)
// SMT1SIG<SMT1SSEL1>
extern volatile __bit                   SMT1SSEL1           __at(0x1881);	// @ (0x310 * 8 + 1)
#define                                 SMT1SSEL1_bit       _BIT_ACCESS(SMT1SIG,1)
// SMT1SIG<SMT1SSEL2>
extern volatile __bit                   SMT1SSEL2           __at(0x1882);	// @ (0x310 * 8 + 2)
#define                                 SMT1SSEL2_bit       _BIT_ACCESS(SMT1SIG,2)
// SMT1SIG<SMT1SSEL3>
extern volatile __bit                   SMT1SSEL3           __at(0x1883);	// @ (0x310 * 8 + 3)
#define                                 SMT1SSEL3_bit       _BIT_ACCESS(SMT1SIG,3)
// SMT1SIG<SMT1SSEL4>
extern volatile __bit                   SMT1SSEL4           __at(0x1884);	// @ (0x310 * 8 + 4)
#define                                 SMT1SSEL4_bit       _BIT_ACCESS(SMT1SIG,4)
// SMT1SIG<SMT1SSEL5>
extern volatile __bit                   SMT1SSEL5           __at(0x1885);	// @ (0x310 * 8 + 5)
#define                                 SMT1SSEL5_bit       _BIT_ACCESS(SMT1SIG,5)
// SMT1TMRL<SMT1TMR0>
extern volatile __bit                   SMT1TMR0            __at(0x1800);	// @ (0x300 * 8 + 0)
#define                                 SMT1TMR0_bit        _BIT_ACCESS(SMT1TMRL,0)
// SMT1TMRL<SMT1TMR1>
extern volatile __bit                   SMT1TMR1            __at(0x1801);	// @ (0x300 * 8 + 1)
#define                                 SMT1TMR1_bit        _BIT_ACCESS(SMT1TMRL,1)
// SMT1TMRH<SMT1TMR10>
extern volatile __bit                   SMT1TMR10           __at(0x180A);	// @ (0x301 * 8 + 2)
#define                                 SMT1TMR10_bit       _BIT_ACCESS(SMT1TMRH,2)
// SMT1TMRH<SMT1TMR11>
extern volatile __bit                   SMT1TMR11           __at(0x180B);	// @ (0x301 * 8 + 3)
#define                                 SMT1TMR11_bit       _BIT_ACCESS(SMT1TMRH,3)
// SMT1TMRH<SMT1TMR12>
extern volatile __bit                   SMT1TMR12           __at(0x180C);	// @ (0x301 * 8 + 4)
#define                                 SMT1TMR12_bit       _BIT_ACCESS(SMT1TMRH,4)
// SMT1TMRH<SMT1TMR13>
extern volatile __bit                   SMT1TMR13           __at(0x180D);	// @ (0x301 * 8 + 5)
#define                                 SMT1TMR13_bit       _BIT_ACCESS(SMT1TMRH,5)
// SMT1TMRH<SMT1TMR14>
extern volatile __bit                   SMT1TMR14           __at(0x180E);	// @ (0x301 * 8 + 6)
#define                                 SMT1TMR14_bit       _BIT_ACCESS(SMT1TMRH,6)
// SMT1TMRH<SMT1TMR15>
extern volatile __bit                   SMT1TMR15           __at(0x180F);	// @ (0x301 * 8 + 7)
#define                                 SMT1TMR15_bit       _BIT_ACCESS(SMT1TMRH,7)
// SMT1TMRU<SMT1TMR16>
extern volatile __bit                   SMT1TMR16           __at(0x1810);	// @ (0x302 * 8 + 0)
#define                                 SMT1TMR16_bit       _BIT_ACCESS(SMT1TMRU,0)
// SMT1TMRU<SMT1TMR17>
extern volatile __bit                   SMT1TMR17           __at(0x1811);	// @ (0x302 * 8 + 1)
#define                                 SMT1TMR17_bit       _BIT_ACCESS(SMT1TMRU,1)
// SMT1TMRU<SMT1TMR18>
extern volatile __bit                   SMT1TMR18           __at(0x1812);	// @ (0x302 * 8 + 2)
#define                                 SMT1TMR18_bit       _BIT_ACCESS(SMT1TMRU,2)
// SMT1TMRU<SMT1TMR19>
extern volatile __bit                   SMT1TMR19           __at(0x1813);	// @ (0x302 * 8 + 3)
#define                                 SMT1TMR19_bit       _BIT_ACCESS(SMT1TMRU,3)
// SMT1TMRL<SMT1TMR2>
extern volatile __bit                   SMT1TMR2            __at(0x1802);	// @ (0x300 * 8 + 2)
#define                                 SMT1TMR2_bit        _BIT_ACCESS(SMT1TMRL,2)
// SMT1TMRU<SMT1TMR20>
extern volatile __bit                   SMT1TMR20           __at(0x1814);	// @ (0x302 * 8 + 4)
#define                                 SMT1TMR20_bit       _BIT_ACCESS(SMT1TMRU,4)
// SMT1TMRU<SMT1TMR21>
extern volatile __bit                   SMT1TMR21           __at(0x1815);	// @ (0x302 * 8 + 5)
#define                                 SMT1TMR21_bit       _BIT_ACCESS(SMT1TMRU,5)
// SMT1TMRU<SMT1TMR22>
extern volatile __bit                   SMT1TMR22           __at(0x1816);	// @ (0x302 * 8 + 6)
#define                                 SMT1TMR22_bit       _BIT_ACCESS(SMT1TMRU,6)
// SMT1TMRU<SMT1TMR23>
extern volatile __bit                   SMT1TMR23           __at(0x1817);	// @ (0x302 * 8 + 7)
#define                                 SMT1TMR23_bit       _BIT_ACCESS(SMT1TMRU,7)
// SMT1TMRL<SMT1TMR3>
extern volatile __bit                   SMT1TMR3            __at(0x1803);	// @ (0x300 * 8 + 3)
#define                                 SMT1TMR3_bit        _BIT_ACCESS(SMT1TMRL,3)
// SMT1TMRL<SMT1TMR4>
extern volatile __bit                   SMT1TMR4            __at(0x1804);	// @ (0x300 * 8 + 4)
#define                                 SMT1TMR4_bit        _BIT_ACCESS(SMT1TMRL,4)
// SMT1TMRL<SMT1TMR5>
extern volatile __bit                   SMT1TMR5            __at(0x1805);	// @ (0x300 * 8 + 5)
#define                                 SMT1TMR5_bit        _BIT_ACCESS(SMT1TMRL,5)
// SMT1TMRL<SMT1TMR6>
extern volatile __bit                   SMT1TMR6            __at(0x1806);	// @ (0x300 * 8 + 6)
#define                                 SMT1TMR6_bit        _BIT_ACCESS(SMT1TMRL,6)
// SMT1TMRL<SMT1TMR7>
extern volatile __bit                   SMT1TMR7            __at(0x1807);	// @ (0x300 * 8 + 7)
#define                                 SMT1TMR7_bit        _BIT_ACCESS(SMT1TMRL,7)
// SMT1TMRH<SMT1TMR8>
extern volatile __bit                   SMT1TMR8            __at(0x1808);	// @ (0x301 * 8 + 0)
#define                                 SMT1TMR8_bit        _BIT_ACCESS(SMT1TMRH,0)
// SMT1TMRH<SMT1TMR9>
extern volatile __bit                   SMT1TMR9            __at(0x1809);	// @ (0x301 * 8 + 1)
#define                                 SMT1TMR9_bit        _BIT_ACCESS(SMT1TMRH,1)
// SMT1STAT<SMT1TS>
extern volatile __bit                   SMT1TS              __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 SMT1TS_bit          _BIT_ACCESS(SMT1STAT,2)
// SMT1WINPPS<SMT1WINPPS0>
extern volatile __bit                   SMT1WINPPS0         __at(0x12C8);	// @ (0x259 * 8 + 0)
#define                                 SMT1WINPPS0_bit     _BIT_ACCESS(SMT1WINPPS,0)
// SMT1WINPPS<SMT1WINPPS1>
extern volatile __bit                   SMT1WINPPS1         __at(0x12C9);	// @ (0x259 * 8 + 1)
#define                                 SMT1WINPPS1_bit     _BIT_ACCESS(SMT1WINPPS,1)
// SMT1WINPPS<SMT1WINPPS2>
extern volatile __bit                   SMT1WINPPS2         __at(0x12CA);	// @ (0x259 * 8 + 2)
#define                                 SMT1WINPPS2_bit     _BIT_ACCESS(SMT1WINPPS,2)
// SMT1WINPPS<SMT1WINPPS3>
extern volatile __bit                   SMT1WINPPS3         __at(0x12CB);	// @ (0x259 * 8 + 3)
#define                                 SMT1WINPPS3_bit     _BIT_ACCESS(SMT1WINPPS,3)
// SMT1WINPPS<SMT1WINPPS4>
extern volatile __bit                   SMT1WINPPS4         __at(0x12CC);	// @ (0x259 * 8 + 4)
#define                                 SMT1WINPPS4_bit     _BIT_ACCESS(SMT1WINPPS,4)
// SMT1WINPPS<SMT1WINPPS5>
extern volatile __bit                   SMT1WINPPS5         __at(0x12CD);	// @ (0x259 * 8 + 5)
#define                                 SMT1WINPPS5_bit     _BIT_ACCESS(SMT1WINPPS,5)
// SMT1STAT<SMT1WS>
extern volatile __bit                   SMT1WS              __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 SMT1WS_bit          _BIT_ACCESS(SMT1STAT,1)
// SMT1WIN<SMT1WSEL0>
extern volatile __bit                   SMT1WSEL0           __at(0x1888);	// @ (0x311 * 8 + 0)
#define                                 SMT1WSEL0_bit       _BIT_ACCESS(SMT1WIN,0)
// SMT1WIN<SMT1WSEL1>
extern volatile __bit                   SMT1WSEL1           __at(0x1889);	// @ (0x311 * 8 + 1)
#define                                 SMT1WSEL1_bit       _BIT_ACCESS(SMT1WIN,1)
// SMT1WIN<SMT1WSEL2>
extern volatile __bit                   SMT1WSEL2           __at(0x188A);	// @ (0x311 * 8 + 2)
#define                                 SMT1WSEL2_bit       _BIT_ACCESS(SMT1WIN,2)
// SMT1WIN<SMT1WSEL3>
extern volatile __bit                   SMT1WSEL3           __at(0x188B);	// @ (0x311 * 8 + 3)
#define                                 SMT1WSEL3_bit       _BIT_ACCESS(SMT1WIN,3)
// SMT1WIN<SMT1WSEL4>
extern volatile __bit                   SMT1WSEL4           __at(0x188C);	// @ (0x311 * 8 + 4)
#define                                 SMT1WSEL4_bit       _BIT_ACCESS(SMT1WIN,4)
// SMT1WIN<SMT1WSEL5>
extern volatile __bit                   SMT1WSEL5           __at(0x188D);	// @ (0x311 * 8 + 5)
#define                                 SMT1WSEL5_bit       _BIT_ACCESS(SMT1WIN,5)
// ADCON3<SOI>
extern volatile __bit                   SOI                 __at(0x1FB3);	// @ (0x3F6 * 8 + 3)
#define                                 SOI_bit             _BIT_ACCESS(ADCON3,3)
// OSCSTAT<SOR>
extern volatile __bit                   SOR                 __at(0x593);	// @ (0xB2 * 8 + 3)
#define                                 SOR_bit             _BIT_ACCESS(OSCSTAT,3)
// OSCEN<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x59B);	// @ (0xB3 * 8 + 3)
#define                                 SOSCEN_bit          _BIT_ACCESS(OSCEN,3)
// OSCCON3<SOSCPWR>
extern volatile __bit                   SOSCPWR             __at(0x57E);	// @ (0xAF * 8 + 6)
#define                                 SOSCPWR_bit         _BIT_ACCESS(OSCCON3,6)
// STKPTR<SP0>
extern volatile __bit                   SP0                 __at(0x27E0);	// @ (0x4FC * 8 + 0)
#define                                 SP0_bit             _BIT_ACCESS(STKPTR,0)
// STKPTR<SP1>
extern volatile __bit                   SP1                 __at(0x27E1);	// @ (0x4FC * 8 + 1)
#define                                 SP1_bit             _BIT_ACCESS(STKPTR,1)
// STKPTR<SP2>
extern volatile __bit                   SP2                 __at(0x27E2);	// @ (0x4FC * 8 + 2)
#define                                 SP2_bit             _BIT_ACCESS(STKPTR,2)
// STKPTR<SP3>
extern volatile __bit                   SP3                 __at(0x27E3);	// @ (0x4FC * 8 + 3)
#define                                 SP3_bit             _BIT_ACCESS(STKPTR,3)
// STKPTR<SP4>
extern volatile __bit                   SP4                 __at(0x27E4);	// @ (0x4FC * 8 + 4)
#define                                 SP4_bit             _BIT_ACCESS(STKPTR,4)
// STKPTR<SP5>
extern volatile __bit                   SP5                 __at(0x27E5);	// @ (0x4FC * 8 + 5)
#define                                 SP5_bit             _BIT_ACCESS(STKPTR,5)
// SPI1CON0<SPI1BMODE>
extern volatile __bit                   SPI1BMODE           __at(0x420);	// @ (0x84 * 8 + 0)
#define                                 SPI1BMODE_bit       _BIT_ACCESS(SPI1CON0,0)
// SPI1CON2<SPI1BUSY>
extern volatile __bit                   SPI1BUSY            __at(0x437);	// @ (0x86 * 8 + 7)
#define                                 SPI1BUSY_bit        _BIT_ACCESS(SPI1CON2,7)
// SPI1CON1<SPI1CKE>
extern volatile __bit                   SPI1CKE             __at(0x42E);	// @ (0x85 * 8 + 6)
#define                                 SPI1CKE_bit         _BIT_ACCESS(SPI1CON1,6)
// SPI1CON1<SPI1CKP>
extern volatile __bit                   SPI1CKP             __at(0x42D);	// @ (0x85 * 8 + 5)
#define                                 SPI1CKP_bit         _BIT_ACCESS(SPI1CON1,5)
// SPI1CLK<SPI1CLKSEL0>
extern volatile __bit                   SPI1CLKSEL0         __at(0x460);	// @ (0x8C * 8 + 0)
#define                                 SPI1CLKSEL0_bit     _BIT_ACCESS(SPI1CLK,0)
// SPI1CLK<SPI1CLKSEL1>
extern volatile __bit                   SPI1CLKSEL1         __at(0x461);	// @ (0x8C * 8 + 1)
#define                                 SPI1CLKSEL1_bit     _BIT_ACCESS(SPI1CLK,1)
// SPI1CLK<SPI1CLKSEL2>
extern volatile __bit                   SPI1CLKSEL2         __at(0x462);	// @ (0x8C * 8 + 2)
#define                                 SPI1CLKSEL2_bit     _BIT_ACCESS(SPI1CLK,2)
// SPI1CLK<SPI1CLKSEL3>
extern volatile __bit                   SPI1CLKSEL3         __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 SPI1CLKSEL3_bit     _BIT_ACCESS(SPI1CLK,3)
// SPI1CLK<SPI1CLKSEL4>
extern volatile __bit                   SPI1CLKSEL4         __at(0x464);	// @ (0x8C * 8 + 4)
#define                                 SPI1CLKSEL4_bit     _BIT_ACCESS(SPI1CLK,4)
// SPI1STATUS<SPI1CLRBF>
extern volatile __bit                   SPI1CLRBF           __at(0x43A);	// @ (0x87 * 8 + 2)
#define                                 SPI1CLRBF_bit       _BIT_ACCESS(SPI1STATUS,2)
// SPI1INTE<SPI1EOSIE>
extern volatile __bit                   SPI1EOSIE           __at(0x45C);	// @ (0x8B * 8 + 4)
#define                                 SPI1EOSIE_bit       _BIT_ACCESS(SPI1INTE,4)
// SPI1INTF<SPI1EOSIF>
extern volatile __bit                   SPI1EOSIF           __at(0x454);	// @ (0x8A * 8 + 4)
#define                                 SPI1EOSIF_bit       _BIT_ACCESS(SPI1INTF,4)
// SPI1CON1<SPI1FST>
extern volatile __bit                   SPI1FST             __at(0x42C);	// @ (0x85 * 8 + 4)
#define                                 SPI1FST_bit         _BIT_ACCESS(SPI1CON1,4)
// PIE3<SPI1IE>
extern volatile __bit                   SPI1IE              __at(0x250A);	// @ (0x4A1 * 8 + 2)
#define                                 SPI1IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<SPI1IF>
extern volatile __bit                   SPI1IF              __at(0x258A);	// @ (0x4B1 * 8 + 2)
#define                                 SPI1IF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<SPI1IP>
extern volatile __bit                   SPI1IP              __at(0x1B2A);	// @ (0x365 * 8 + 2)
#define                                 SPI1IP_bit          _BIT_ACCESS(IPR3,2)
// SPI1CON0<SPI1LSBF>
extern volatile __bit                   SPI1LSBF            __at(0x422);	// @ (0x84 * 8 + 2)
#define                                 SPI1LSBF_bit        _BIT_ACCESS(SPI1CON0,2)
// PMD6<SPI1MD>
extern volatile __bit                   SPI1MD              __at(0x331);	// @ (0x66 * 8 + 1)
#define                                 SPI1MD_bit          _BIT_ACCESS(PMD6,1)
// SPI1CON0<SPI1MST>
extern volatile __bit                   SPI1MST             __at(0x421);	// @ (0x84 * 8 + 1)
#define                                 SPI1MST_bit         _BIT_ACCESS(SPI1CON0,1)
// SPI1STATUS<SPI1RXBF>
extern volatile __bit                   SPI1RXBF            __at(0x438);	// @ (0x87 * 8 + 0)
#define                                 SPI1RXBF_bit        _BIT_ACCESS(SPI1STATUS,0)
// PIE3<SPI1RXIE>
extern volatile __bit                   SPI1RXIE            __at(0x2508);	// @ (0x4A1 * 8 + 0)
#define                                 SPI1RXIE_bit        _BIT_ACCESS(PIE3,0)
// PIR3<SPI1RXIF>
extern volatile __bit                   SPI1RXIF            __at(0x2588);	// @ (0x4B1 * 8 + 0)
#define                                 SPI1RXIF_bit        _BIT_ACCESS(PIR3,0)
// IPR3<SPI1RXIP>
extern volatile __bit                   SPI1RXIP            __at(0x1B28);	// @ (0x365 * 8 + 0)
#define                                 SPI1RXIP_bit        _BIT_ACCESS(IPR3,0)
// SPI1INTE<SPI1RXOIE>
extern volatile __bit                   SPI1RXOIE           __at(0x45A);	// @ (0x8B * 8 + 2)
#define                                 SPI1RXOIE_bit       _BIT_ACCESS(SPI1INTE,2)
// SPI1INTF<SPI1RXOIF>
extern volatile __bit                   SPI1RXOIF           __at(0x452);	// @ (0x8A * 8 + 2)
#define                                 SPI1RXOIF_bit       _BIT_ACCESS(SPI1INTF,2)
// SPI1CON2<SPI1RXR>
extern volatile __bit                   SPI1RXR             __at(0x430);	// @ (0x86 * 8 + 0)
#define                                 SPI1RXR_bit         _BIT_ACCESS(SPI1CON2,0)
// SPI1STATUS<SPI1RXRE>
extern volatile __bit                   SPI1RXRE            __at(0x43B);	// @ (0x87 * 8 + 3)
#define                                 SPI1RXRE_bit        _BIT_ACCESS(SPI1STATUS,3)
// SPI1SCKPPS<SPI1SCKPPS0>
extern volatile __bit                   SPI1SCKPPS0         __at(0x1350);	// @ (0x26A * 8 + 0)
#define                                 SPI1SCKPPS0_bit     _BIT_ACCESS(SPI1SCKPPS,0)
// SPI1SCKPPS<SPI1SCKPPS1>
extern volatile __bit                   SPI1SCKPPS1         __at(0x1351);	// @ (0x26A * 8 + 1)
#define                                 SPI1SCKPPS1_bit     _BIT_ACCESS(SPI1SCKPPS,1)
// SPI1SCKPPS<SPI1SCKPPS2>
extern volatile __bit                   SPI1SCKPPS2         __at(0x1352);	// @ (0x26A * 8 + 2)
#define                                 SPI1SCKPPS2_bit     _BIT_ACCESS(SPI1SCKPPS,2)
// SPI1SCKPPS<SPI1SCKPPS3>
extern volatile __bit                   SPI1SCKPPS3         __at(0x1353);	// @ (0x26A * 8 + 3)
#define                                 SPI1SCKPPS3_bit     _BIT_ACCESS(SPI1SCKPPS,3)
// SPI1SCKPPS<SPI1SCKPPS4>
extern volatile __bit                   SPI1SCKPPS4         __at(0x1354);	// @ (0x26A * 8 + 4)
#define                                 SPI1SCKPPS4_bit     _BIT_ACCESS(SPI1SCKPPS,4)
// SPI1CON1<SPI1SDIP>
extern volatile __bit                   SPI1SDIP            __at(0x429);	// @ (0x85 * 8 + 1)
#define                                 SPI1SDIP_bit        _BIT_ACCESS(SPI1CON1,1)
// SPI1SDIPPS<SPI1SDIPPS0>
extern volatile __bit                   SPI1SDIPPS0         __at(0x1358);	// @ (0x26B * 8 + 0)
#define                                 SPI1SDIPPS0_bit     _BIT_ACCESS(SPI1SDIPPS,0)
// SPI1SDIPPS<SPI1SDIPPS1>
extern volatile __bit                   SPI1SDIPPS1         __at(0x1359);	// @ (0x26B * 8 + 1)
#define                                 SPI1SDIPPS1_bit     _BIT_ACCESS(SPI1SDIPPS,1)
// SPI1SDIPPS<SPI1SDIPPS2>
extern volatile __bit                   SPI1SDIPPS2         __at(0x135A);	// @ (0x26B * 8 + 2)
#define                                 SPI1SDIPPS2_bit     _BIT_ACCESS(SPI1SDIPPS,2)
// SPI1SDIPPS<SPI1SDIPPS3>
extern volatile __bit                   SPI1SDIPPS3         __at(0x135B);	// @ (0x26B * 8 + 3)
#define                                 SPI1SDIPPS3_bit     _BIT_ACCESS(SPI1SDIPPS,3)
// SPI1SDIPPS<SPI1SDIPPS4>
extern volatile __bit                   SPI1SDIPPS4         __at(0x135C);	// @ (0x26B * 8 + 4)
#define                                 SPI1SDIPPS4_bit     _BIT_ACCESS(SPI1SDIPPS,4)
// SPI1CON1<SPI1SDOP>
extern volatile __bit                   SPI1SDOP            __at(0x428);	// @ (0x85 * 8 + 0)
#define                                 SPI1SDOP_bit        _BIT_ACCESS(SPI1CON1,0)
// SPI1CON1<SPI1SMP>
extern volatile __bit                   SPI1SMP             __at(0x42F);	// @ (0x85 * 8 + 7)
#define                                 SPI1SMP_bit         _BIT_ACCESS(SPI1CON1,7)
// SPI1INTE<SPI1SOSIE>
extern volatile __bit                   SPI1SOSIE           __at(0x45D);	// @ (0x8B * 8 + 5)
#define                                 SPI1SOSIE_bit       _BIT_ACCESS(SPI1INTE,5)
// SPI1INTF<SPI1SOSIF>
extern volatile __bit                   SPI1SOSIF           __at(0x455);	// @ (0x8A * 8 + 5)
